app/controllers/tweets_controller.rb

  def retweet
    exito = false

    user_id  = params[:user_id]
    tweet_id = params[:tweet_id]
    to_unretweet  = params[:to_unretweet]

    if User.exists?(user_id) && Tweet.exists?(tweet_id)
      user   = User.find(user_id)
      tweet  = Tweet.find(tweet_id)


      if to_unretweet == "false"
        user.retweets << tweet
      else
        user.retweets.delete(tweet)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "tweets".* FROM "tweets"  WHERE "tweets"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 23]]
INSERT INTO "retweets" ("created_at", "tweet_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-05-01 18:08:46.039360"], ["tweet_id", 23], ["updated_at", "2015-05-01 18:08:46.039360"], ["user_id", 2]]
DELETE FROM "retweets" WHERE "retweets"."user_id" = ? AND "retweets"."tweet_id" = 23  [["user_id", 2]]

  def fav

    exito = false

    user_id  = params[:user_id]
    tweet_id = params[:tweet_id]
    to_unfav  = params[:to_unfav]

    if User.exists?(user_id) && Tweet.exists?(tweet_id)
      user   = User.find(user_id)
      tweet  = Tweet.find(tweet_id)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "tweets".* FROM "tweets"  WHERE "tweets"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 23]]

  def create
    @tweet = Tweet.new(tweet_params)

    respond_to do |format|
      if @tweet.save
---
INSERT INTO "tweets" ("created_at", "quote_tweet", "tweet_text", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-05-01 18:37:16.886005"], ["quote_tweet", 25], ["tweet_text", "quote_tweet 2"], ["updated_at", "2015-05-01 18:37:16.886005"], ["user_id", 2]]