app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 3  ORDER BY "users"."id" ASC LIMIT 1
---
  def follow
    exito = false

    follower_id  = params[:follower_id]
    following_id = params[:following_id]
    to_unfollow  = params[:to_unfollow]

    if User.exists?(follower_id) && User.exists?(following_id)
      follower  = User.find(follower_id)

SELECT "users".* FROM "users"
---
  def met_people
    @users = User.all