app/views/application/_stats.html.erb

SELECT "tweets".* FROM "tweets" INNER JOIN "retweets" ON "tweets"."id" = "retweets"."tweet_id" WHERE "retweets"."user_id" = ?  ORDER BY created_at DESC  [["user_id", 2]]
SELECT COUNT(*) FROM "tweets" INNER JOIN "faved_favers" ON "tweets"."id" = "faved_favers"."tweet_id" WHERE "faved_favers"."user_id" = ?  [["user_id", 2]]
---
	 <div class="col-md-3" align="center">
	 	<b>Tweets:</b><br/> <%=current_user.tweets_with_retweets.count%><br/>